import 'package:flutter/material.dart';
import 'package:prakash_barnamaala/primarylist/list.dart';
import 'package:prakash_barnamaala/primarylist/modal.dart';

class LanguagePoem03 extends StatelessWidget {

  @override
  Widget build(BuildContext context) {
    return new Scaffold(
        appBar: makeTopAppBar,
        body: new SongList(_buildList()));
  }

  // Top App Bar
  final makeTopAppBar = AppBar(
    elevation: 0.1,
    backgroundColor: Color.fromRGBO(58, 66, 86, 1.0),
    title: Text('नैतिक दृष्टान्त', style: TextStyle(color: Colors.white)),
    centerTitle: true,
  );

  _buildList() {
    List<SongPoemComprehensionModal> data = new List<SongPoemComprehensionModal>();

    String songTitle = " नैतिक दृष्टान्त ";

    List<String> songBody = [

      "लेखनाथ पौड्याल\n\n",
    'बडाले जे गर्यो काम हुन्छ त्यो सर्व-संमत ।\n'+
    'छैन शङ्करको नङ्गा, मगन्ते भेष निन्दित ।।\n',

    'गरदैन ठूलो व्यक्ति मर्यादा-स्थिति-लङ्घन ।\n'+
    'बसेको छ महासिन्धु सीमाबद्ध बनीकन ।।\n',

    'दबिन्छ गुणिको दोष गुणका राशिमा परी ।\n'+
    'रश्मिले चन्द्रको दाग दबाएकै छ बेसरी ।।\n',

    'कसैको लोकमा छैन एकैनास समुन्नति ।\n'+
    'अरूको के कुरा हेर सन्ध्यामा सूर्यको गति ।।\n',

    'छोटो बढ्यो भने ज्यादा फूर्ति ढाँचा बढाउँछ ।\n'+
    'उर्लंदो खहरे हेर कत्तिको गड्गडाउँछ ।।\n',

    'ज्यादा सोझो हुनुभन्दा टढिनु छ फला-धिक ।\n'+
    'गरदैन कुनै सोझो ग्रहको पूजना–दिक ।।\n',

    'टपर्टुञ्या पनि हुन्छ मूर्खमध्ये प्रतिष्ठित ।\n'+
    'बोलने को अँध्यारोमा महा–त्मा जुन्किरीसित ।।\n',

    'सानैदेखि छुचो हुन्छ दुष्ट मानिसको मति ।\n'+
    'घोचने जङ्गली काँढा पहिले नै तिखा कति ।।\n',

    'मिलेर काम गर्नाले हुन्छ अत्यन्त फायदा ।\n'+
    'एकता हेर कस्तो छ मौरीको महमा सदा ।।\n',

    'जो दिंदैन उही दिन्छु भनी गर्जन्छ सत्त्वर ।\n'+
    'जो हो नवर्षने मैघ उसैको हुन्छ घर्घर ।।\n',

    'हुनुपर्दछ मौकामा शत्रुको पनि सेवक ।\n'+
    'कोइली कागकै बच्चा बन्छ सानू छँदा तक ।।\n',

    'गुणग्राही जहाँ छैन वहाँ के गरला गुणी ।\n'+
    'कौडीमा तक मिल्किन्छ भिल्लका देशमा मणि ।।\n',

    'योग्य स्थानविषे मान सानाले पनि पाउँछ ।\n'+
    'कृष्णाका तटको ढुङ्गा देवता कहलाउँछ ।।\n',

    'उपकारी गुणी व्यक्ति निहुरन्छ निरन्तर ।\n'+
    'फलेको वृक्षको हाँगो नझुकेको कहाँ छ र ।।\n',

    'मेटिंदैन कसैबाट आफनू कर्मपद्धति ।\n'+
    'बनवासी बने राम चौधै भुवनका पति ।।\n',

    'धर्म हो धीरको धैर्य राखनू दु:खजालमा ।\n'+
    'मानू मौनव्रती हुन्छ कोइली शीतकालमा ।।\n',

    'सारा सार लिई कन्था छोडी-दिन्छ गुणी जन ।\n'+
    'रस चुसेपछि भृङ्ग फूलमा भुल्दथ्यो किन ?\n',

    'सङ्गले पनि जाँदैन दुष्टको दुष्टा रिस ।\n'+
    'श्रीखण्डमा बसी सर्प कहाँ हुन्थ्यो र निर्विष ।।\n',

    'मूर्खका मनमा अर्ती गालीतुल्य बिझाउँछ ।\n'+
    'दूधपान गरी सर्प खालि विष बहाउँछ ।।,\n',

    ];

    for (int i = 0; i < songBody.length; i++) {
      data.add(new SongPoemComprehensionModal(
          genericTitle: songTitle,
          genericBody: songBody[i]
      ),
      );
    }
    return data;
  }



}
