import 'package:flutter/material.dart';
import 'package:prakash_barnamaala/primarylist/list.dart';
import 'package:prakash_barnamaala/primarylist/modal.dart';

class Adage extends StatelessWidget {

  _buildList() {

    List<LanguageModal> data = new List<LanguageModal>();
    List<String> primaryLetter = [
      "अंध्यारामा बस्ने झुत्री बुढी,बिहानै उठी लुटुपुटु गर्छे",
      "अंध्यारोमा देखिन्छ,उज्यालोमा छैन,जति कोसिस गरे पनि टिप्न सकिंदैन",
      "अक्षर छ,किताब होइन,गोलो छ,इनार होइन,संसार डुल्छ,खुट्टा छैन",
      "अखेटे पखेटे गहभरि आंसु,भित्र नसा बाहिर मासु",
      "अगि हिंड्दै छ,पछि पाइला मिट्दै छ",
      "अघिपछि गुटमुटिएर बस्ने,पाहुनापाछा आए उत्तानो परेर सुत्ने",
      "अघि म हरियो थिए,पछि भए राती,कुन बैरीका फेला परे कागजस्ती काली भए",
      "अचम्मकी चरी ,आगोमा परी ,पुच्छरले पानी खांदै ऐय्याएय्या गरी",
      "अलङकी रानी पलङमा सुत्छे,सुर्जेलाइ देख्दा लुपुक्क लुक्छे",
      "अरूले देख्ने घामले नदेख्ने",

      "आंसुल पांसुल रातभरि टांसुला,झिसिमिसेमै फुल निस्की अफ्नै ठाउंमा बसुंल",
      "आई बुढी मच्चिदै ,गई बुढी थच्चिंदै",
      "आकाशकी रानी पातालमा खसी ,सूर्यलाई देख्दा थुपुक्क बसी",
      "आकाशमा आगो पातालमा पानी,म्वाई खान जांदा चिच्चाउने बानी",
      "आगो न पानीको लल्लोरे रोटी",
      "आमा जगल्टे,बाबु खपटे,छोराछोरी मिठी पापा",
      "आमा झुन्डिई छोरी हिंडी",
      "आमा माथि छोरी लखर लखर",
      "इन्द्रिनी खोला,छिन्द्रिनी पानी,बेताले बुढीको बोलाउने बानी",
      "आमा रूपैली,बाबु झुपाइलो,छोरी फुस्री",

      "इन्द्रिनी खोला छिन्द्रिनी पानी,बेताले बुढीको बोलाउने बानी",
      "इलम खासै छैन केही ,सधैंभरि घुम्छ,पानी परेपछि प्राणपखेरू उड्छ",
      "उज्यालो चरी आगोमा जली,पुच्छरले पानी खांदै झलमल बली",
      "एउटा खुट्टा सयों हात,सयों हातमा हजारों पात",
      "एउटा तन्न एउटा धन्न,कैले लो लो कैले हुन्न",
      "एउटी आमाका बत्तीस छोरा,आमालाई कुट्छन सधैं मोरा",
      "एक अंधेरी साथी मेरी,सधैं पछ्याउछिन कत्ति नटेरी",
      "एक फेर आउंछ ,मुखबाट ब्याउंछ",
      "एकसिङगे गाई,जति खुवायो उति खाई",
      "ओक्ल-दोक्कल भुंडी खोकल",

      "ओडारबाहिर हड्डीको तांती,यो कथा नजान्ने बिरालोको नाति",
      "कथा  कुथुङग्री कन्डापट्टि गांड,यो कथा नजान्ने बोक्सीको रांड",
      "किन्नेले लाउन्न,लाउनेले किन्दैन",
      "कुनामा बस्छ,देशविदेश घुम्छ",
      "खटपट खटपाउ,तीन मुख दस पाउ",
      "खांदै छ हग्दै छ",
      "खान नपाइन्जेल झोक्रि बस्ने,खाएपछि घुमीघुमी नाच्ने",
      "खिरिलो सांढेको जीउभरि सिङैसिङ",
      "खुट्टामा लगाए मान-सम्मान,टाउकामा लगाए अपमान",
      "खोइ-खोइ बुढा, म अघि जान्छु",

      "खोलो तरेकी राती गाई,चुली पुगी भन्ज्याङ आई",
      "गजुर छ,मन्दिर होइन,पखेटा छ,चरा होइन,करङ छ, मान्छे होइन,घुम्रिएको पुच्छर छ, कुकुर होइन",
      "गैरीखेत टिलपिले पानी,बसिखाने चम्पै रानी",
      "घरबाट जांदा मरेर जाने,वनबाट बिउंती आंखा तरी आउने",
      "घर भने झुप्रो,मान्छेको थुप्रो",
      "घमाई-घुमाई पोखरी,नङ छेडने घाउ,यो कथा नजाने मुसा पोली खाऊ",
      "चरी होइन चुच्चो छ, जन्तु होइन खुट्टा छ",
      "चार भाइ एकै लङमा,एक भाइ छुट्टै",
      "चारैतिर माटो बीचमा सुनको बाटो",
      "चाल त्यसको छट्केमट्के,बसाइ त्यसको जांतो,दांत उसको अनारदाना,माया उसको रांको",

      "च्याप्प समाई भुइंमा पसारी,सल्याङमल्याङ पार्दा धुलोमैलो थुपारी",
      "छ जोगी बा र बाहुन,तीन लांक्रा उखु सिङगासिङगै खाऊन",
      "जलको जन्म थलको बास,त्यो नभए हुन्छ उपवास",
      "जुंगा तान्दा मुसुक्क हांस्ने,अरू बेला गुठुरी गांस्ने",
      "झक्कंले बोकाको नक्कले कान,लो लो बुढा बल गरी तान",
      "ठ्याप्प पाइला ध्याप्प कान, साना आंखा ठुलो ज्यान",
      "डल्ली चरीको पेटमा कल्ली,पुच्छरमा धातु जडी अंधेरीमा बल्ली",
      "तल थाल माथि झाल,त्यसमाथि हीरालाल",
      "तामाको गाग्रीमा सुनको असर्फी",
      "तामाको दैलो,चांदीको संघार,भित्रकी नानी घुरूक्क उघार",

      "थचक्क बसिरहने काली रांड हग्छे हड्डी वाक्छे जांड",
      "दुईतिर चुरीफुरी अगिल्तिर हुल,इनारका मुखमा कदमका फूल",
      "दुलाहा गयो दुलही लिन,जन्ती गए किन,बाउबिनाको छोरा जन्म्यो,आमा नभाको दिन",
      "नखाऊ भने दिनभरिको सिकार,खाउ भने कान्छाबाको अनुहार",
      "न बाहिर बोक्रो न भित्र खोक्रो,मुखमा हाल्यो धुलो र पिठो",
      "पखेटा छन् परेवा होइन,घोप्टे सिङ छन् चोपाया होइन",
      "पहिले कपाल लुछछ्न अनि हड्डी फोर्छन,काटकुट पारी बांडीचुंडी खान्छन",
      "पहिले हामी जन्म्यों,पछि जन्मे जेठा दाइ,बाबा जन्मेको हामीले देख्यों,पछि जन्म्यो कान्छो भाइ",
      "पुच्छर थिच्दा जुरूक्क उठ्ने,चटक्कै छोडे चुच्चाले टेक्ने",
      "बाबु मेरा तिखेताखे ,आमा सुन प्यांली ,कसका गोत गइछु म ता हांडीभन्दा काली",

      "बेसीमा कुलो लेखमा खेत,कतातिर टुप्पो कतातिर फेद",
      "बोटमा फल्ने रतिया नानी,आंखामा राखे नबिझाउने बानी",
      "भित्र छरो भित्रै उम्रियो टाउकामा चढी गाउं चाहारो",
      "माझको टारी,उत्तानो पारी,दुई घुंडा मारी,ख्यासख्यास पारी दुइ थोपा झारी",
      "यही मेरो ढिकी यही मेरो कोल,यही मेरो जांतो सिपीको खोल",
      "यो मेरो टेक्ने,यो मेरो छेक्ने,परिआएको बेलामा पुर्पुरो सेक्ने",
      "राती गाई लिन जांदा कोप्री गाईले हानी",
      "लेकको पोखरी स्याप्प सुक्ला,त्यहांको बकुल्लो ठहरै बित्ला",
      "लोराको तोरो,तोराको झोल,झोलको खोटी,खोटीको रोटी",
      "वन डढ्यो रांटो डढेन",

      "वनमा जन्मे ,वनमा हुर्के ,वनमै मेरो बास,बार वर्ष जलमा डुबे,अब केको आस",
      "वरिपरि डिल माझमा टार, काम सकिनासाथ नुहाउने हतार",
      "वर्षैभरि झुन्डिएर बस्छु,महिनामा एकचोटि अनुहार फेर्छु",
      "वारिदेखि पारिसम्म लस्करै दांत, शिरमाथि नाच्ने त्यसको जात",
      "शरीर पनि सानै,झन सानो मुख,आवाज निस्क्यो भने अरूलाई दुख",
      "श्रीपेच छ राजा होइन,पखेटा छन पंखा होइन,नङग्रा छन भालु होइन",
      "सखरखन्ड पोटिलो मूला फोक्सो,यो कथा नजान्ने पक्का बोक्सो",
      "समुद्र छ समुद्र होइन,पहाड छ पहाड होइन,सहर छ सहर होइन",
      "सयवटा खांबा सयवटै दाम्ला ,यो कथा नजान्नेलाई सय बाजी लाम्ला",
      "सानी-सानी नी फुर फुर गर्छिन",

      "सानो छउन्जेल मासु खाने,ठुलो भएपछि छाला काढ्ने",
      "सानो बोटमा रातो बन्छु , सुन जोख्ता साथै हुन्छु",
      "हकुवा गोरू , भित्तो फोरू",
      "हाम्री घरकी सानी नानी,रनवन डुल्ने तिनको वानी",
      "हाल्दा लुलो,झिक्ता दरो",
      "हाल्दा सेतो झिक्दा रातो",
      "हिंड्छ खुट्टा छैन , बोल्छ मुख छैन",
      "हेर्दाखेरि रूवाजस्तो फुसफुस गर्ने,पहाडका चुलीतिर पत्रैपत्र पर्ने",
      "हेर्दा छ समात्दा छैन",
      "ह्यां पनि छैन,त्यां पनि छैन,काफल पाक्यो बोक्रै छैन"
    ];

    List<String> secondaryLetter = [
      "पोतोले पोतेको", " तारा", " पैसा", " आंप", " डुङगा", " गुन्द्री", " चुक", " बत्ति र तेल", " शीत", " अध्यांरो",
      "आग्लो", " पिङ", " शीत", " तमाखु खाएको", " मोरीको चाको", " नरिवल", " ताला र चावी", " मसला पिसेको", "पानी घट्ट", "तिउरीको फूल",
      "पानीघट्ट", " घडी", " टुकी र दियो", " रूख", " तबला", " जिभ्रो र दांत", " छांया", " केराको बोट", " जांतो", "ठेको पखालेको",
      "दांत ", " दैलाको गांड ", " कात्रो ", " हुलाक टिकट ", " हलो जोतेको ", " जांतो पिधेंको ", " जिब्रो ", "तीते करेला", "जुत्ता ", " लोरो",
      "पोते लगाएको ", " छाता ", " सेलरोटी पकाएको ", " नाम्लो ", " माहुरीको घार ", "टपरी गांसेको ", " चुलेंसी", "बुढी औंला", "हलेदो", " सर्प",
      "कुचो लगाएको ", " बाबु बाहुन र जोगी ", " नुन ", " थैली ", " मुला उखेलेको ", "हात्ती ", " बिजुलीको चिम", "खुर्सानी ", "पाकेको खुर्सानी ", "मुख दांत र जिब्रो",
      "कोल ", " ओखलमा धान कुट्ने ", " कुमालकोटी", " बांदर ", " कसार ", " पुतली ", " नरिवल", "दुध दही मोही र घिउ", "ढिकी ", " चुत्रो",
      "इन्द्रेनी ", " रातीगेडी ", " जमरा ", " चन्दन घोटेको ", " दांत ", " लोरो ", " बयर ", " तेल निथ्रेको बत्ती ", " उखु र रस", "बाटो",
      "डुङगा ", " थाल ", " भित्तेपात्रो ", " काइंयो", "बन्दुक ", " कुखुराको भाले ", " नरसिंहा र कर्नाल बाजाहरू", "नक्सा ", "पुल ", " चर्खा",
      "बांस", "राती गेडी", "मुसो", "काइंयो", "रोटी", "सेल रोटी पकाएको", "खोलो", "हिंउं", "छायां", "असिना"
    ];

    for (int i = 0; i < primaryLetter.length; i++) {

      data.add(new LanguageModal(
          primaryLetter: primaryLetter[i],
          secondaryLetter: secondaryLetter[i]
      ));
    }
    var shuffleData = data.toList()
      ..shuffle();
    return shuffleData;

  }

  // Top App Bar
  final makeTopAppBar = AppBar(
      elevation: 0.1,
      backgroundColor: Color.fromRGBO(58, 66, 86, 1.0),
      title: Text('Adage', style: TextStyle(color: Colors.white)),
      centerTitle: true,
  );

  @override
  Widget build(BuildContext context) {
    return new Scaffold(
        appBar: makeTopAppBar,
        body: new LanguageList(_buildList()));
  }
}


