import 'package:flutter/material.dart';
import 'package:prakash_barnamaala/primarylist/primary_list.dart';
import 'package:prakash_barnamaala/home_widget.dart';
import 'package:prakash_barnamaala/primarylist/modal/modal_primary.dart';

class Ukhaan extends StatelessWidget {
  
  _buildList() {

    List<LetterModal> data = new List<LetterModal>();

    List<String> primaryLetter_list = [
      "अकबरी सूनलार्इ कसी लाउनु पर्दैन",
      "अचानाको चोट खुकुरीले जान्दैन",
      "अर्काको नासो गलाको पासो",
      "अल्छी तिघ्रो स्वादे जिभ्रो",
      "आलु खाएर पेडाको धाक",
      "आए आंप गए झटारो",
      "आकाशको फल आंखा तरी मर",
      "आफु नमरी स्वर्ग देखिन्न",
      "अड्को पड्को तेलको धुप",
      "इन्द्रका आगे स्वर्गको बखान",

      "आफ्नो आङको भैंसी नदेख्ने अर्काको आङको जुम्रो देख्ने",
      "आफ्नो हात जगन्नाथ",
      "आंटी छोरालार्इ बाघले खांदैन",
      "र्इश्वर दाहिना भए सबैथोक हुन्छ",
      "उम्केको माछो ठुलो",
      "एक कान दुई कान मैदान",
      "एक पन्थ दुई काम",
      "एक कानले सुन्नु अर्को कानले उडाउनु",
      "एक हातले ताली बज्दैन",
      "ओरालो लागेको मृगलाई बाच्छाले खेद्छ",

      "औंलो दिंदा डुंडुलो निल्ने",
      "कसैलाई काखा कसैलाई पाखा",
      "कसैले तपांई भनोस नभनोस् आफै मपाई",
      "कागलाई बेल पाक्यो हर्ष न बिस्मत",
      "कानो गोरुलाई औंसी न पुर्णे",
      "काम गर्ने कालु मकै खाने भालु",
      "काम कुरो एकातिर कुम्लो बोकी ठिमीतिर",
      "कालो अक्षर भैंसी वरावर",
      "के खान्छस् काना आंखो",
      "किन रोईस् मङगले आफ्नै ढंङगले",

      "खाएको विष मात्र लाग्छ",
      "खाने मुखलाई जुंगाले छेक्तैन",
      "गांस छोड्नु साथ नछोड्नु",
      "घांटी हेरी हाड निल्नु",
      "घोडा चडे लड्छ",
      "चोक्टा खान गएको बुढी झोलमा डुबेर मरी",
      "जति जोगी आए पनि कानै चिरेका",
      "जब भयो राती अनि बुढी ताती",
      "जति भांडो उति चुबुर्को",
      "जहां ईच्छा त्यहां उपाय",

      "जसलाई तिर्खा लाग्छ उही खोलो धाउंछ",
      "जांगर न सांगर खाने बेला आं गर",
      "जिउंदोको जन्ती मर्दाको मलामी",
      "जो होचो उसको मुखमा घोंचो",
      "ढुंङगो खोज्दा देउता मिल्नु",
      "ताक परे तिवारी नत्र गोतामे",
      "दुवै हातमा लड्डु",
      "देख्नेका आंखा फुटे सुन्नेका सही",
      "धान खाने मुसो चोट पाउने भ्यागुतो",
      "धोबीको कुकुर घरको न घाटको"
    ];

    List<String> secondaryLetter_list = [
      "राम्रो वस्तुलार्इ जांच्नु पर्दैन ",
      "दुःख पाउनेको पीडा दुःख दिनेलार्इ थाह हुदैन ",
      "अर्काको वस्तु चलाउनु अपजस खानु मात्र हो ",
      "परिश्रम नगरी मीठो खान खोज्नु ",
      "क्षमता नहुनेले धाक देखाउनु ",
      "विना नोक्सानी प्रयास गर्दा फार्इदा भए ठिकै नभए पनि ठिकै ",
      "असम्भव कुराको अपेक्षा राख्नु बेकार हुन्छ ",
      "नभोगी यथार्थ थाहा पाइन्न ",
      "चाहेको कुरा नपाउदा अरु चीजले काम चलाउनु ",
      "जान्नेको अगाडि नजान्नेले जान्ने बन्न खोज्नु",

      "आफ्नो कमजोरी नदेख्ने अरुलाई खोट लगाउने",
      "आफ्नो वस भएपछि जे पनि गर्नु हिम्मत गरे",
      "अवरोधलाई पन्छाउन सकिन्छ",
      "भाग्यमा भए सबैतिर फाईदा हुन्छ",
      "प्राप्त नभएको चिज बढी महत्वपुर्ण हुन्छ",
      "अलिअलि गर्दै प्रचार हुन्छ",
      "एक प्रयासले दुई काम गर्नु",
      "वेवास्ता गर्नु",
      "एकोहोरो सहयोग मात्र खोज्नु",
      "कामचोरलाई सबैले हेप्छन",

      "जति दियो उति खोज्ने",
      "भेदभाव गर्नु",
      "आफ्नो प्रसंसा आफै गर्नु",
      "अनावश्यक कुरामा चासो नराख्नु",
      "केहि कुराको बिचार नगर्ने",
      "परिश्रम एउटाले गर्ने फल अर्काले चाख्ने",
      "लक्ष्य विपरितको काम गर्नु",
      "निरक्षर हुनु",
      "खोजेकै कुरा पाउनु",
      "आफैले गल्ती गरेर दुःख पाउनु",

      "गल्ती गरे मात्र सजाय पाईन्छ",
      "चाहाना भए केहीले रोक्दैन",
      "सबै छोडेर मित्रलाई साथ दिनुपर्छ",
      "आफ्नो क्षमता अनुसार काम गर्नुपर्छ",
      "काम गर्ने असफल पनि हुनसक्छन",
      "धेरै पाउन खोज्दा दुःख पाउनु",
      "सबै उस्तै काम नलाग्ने",
      "समय घर्केपछि काम थाल्नु",
      "जति सामान बढे पनि खांचो उस्तै",
      "हुनु इच्छा भए केहीले रोक्दैन",

      "आवश्यक पर्ने प्रयत्न गर्छ",
      "परिश्रम बिना फलको अपेक्षा गर्नु",
      "दुःख सुःखमा साथ दिनु",
      "कमजोरलाई सबैले हेप्छन",
      "खोजेभन्दा राम्रो पाउनु",
      "अवसरको पछि लाग्नु",
      "दुवैतिर फाइदा",
      "देख्नेभन्दा सुनी जान्ने बन्न खोज्नु",
      "गल्ती गर्ने एउटा सजाय पाउने अर्को",
      "कुनै टुङगो नभएको"
    ];

    for (int i = 0; i < primaryLetter_list.length; i++) {

      data.add(new LetterModal(
          primaryLetter: primaryLetter_list[i],
          secondaryLetter: secondaryLetter_list[i]
      ));
    }
    return data;

  }

  @override
  Widget build(BuildContext context) {
    return new Scaffold(
        body: new LetterList(_buildList())
        );
  }
}


